{"meta":{"title":"MasteringAnsible.com","subtitle":null,"description":"Official website for the Mastering Ansible online course","author":"James Spurin","url":"http://masteringansible.com","root":"/"},"pages":[{"title":"About Mastering Ansible","date":"2019-03-08T18:52:38.000Z","updated":"2019-03-14T19:24:14.000Z","comments":true,"path":"about/index.html","permalink":"http://masteringansible.com/about/index.html","excerpt":"","text":"The Mastering Ansible Video Course. 11.5 hours of the finest Ansible Video Training available. Video DescriptionExploit the power of Ansible to expedite scalable orchestration, DevOps, and automation About This VideoSuitable for users of all major operating systems (Windows, Mac OS X, and Linux). Explore Ansible with cloud services and its AWS provisioning. Troubleshoot Ansible and its supported resources and utilities. In DetailAnsible is a radically simple IT automation engine that automates cloud provisioning, configuration management, application deployment, intra-service orchestration, and many other IT needs. Designed for multi-tier deployments since day one, Ansible models your IT infrastructure by describing how all of your systems inter-relate, rather than just managing one system at a time. This professional video course on Ansible guides the user through a multitude of topics in order to understand and professionally master Ansible. It aims to help you master Ansible while tackling and learning multiple topics. It starts with Ansible’s architecture and how to provide effective scalable automation. Then we move on to installing and configuring it with various platforms. Further, we look into Ansible modules and playbooks with YAML syntax and execute it. Next you will get to know about advanced Ansible playbooks, and even structure them. You will learn to use Ansible with cloud services and containers and provision it with AWS and Docker. Finally, you will master troubleshooting, validating, and testing with Ansible. About the Author - James Spurin James Spurin is an IT professional with over 15 years of experience, working in a variety of technology fields including Internet Technologies, Automation, Software Development, Enterprise Storage and Unix Administration. Holds an MSc with Distinction in Computer Science, Information Technology from Liverpool University. Has professionally worked for a variety of major organisations including Nomura, Goldman Sachs, Hitachi Data Systems, Dell EMC and Virgin Internet. Also an advisory board member for StorageOS, a container based storage solution. An active contributor to open source software and also the creator of XML Dataset, a python library featured on the Awesome Python list under XML parsers. About the Technical Reviewer - Ana Jalba Ana Jalba is the technical reviewer for the course. Ana, has an extensive background in Software Development and is a Software Engineer at Hotels.com, not to mention, a long time user and advocate of Ansible. During the course creation, Ana went through every aspect providing extensive feedback and testing, both of the initial course run book, and the video course. About the Senior Content Developer Editor - Abhishek Angne Abhishek has a meticulous eye for detail, and within his role at Packt as the Senior Content Developer Editor, worked with local teams covering all aspects of post development, enhancements and marketing. About the Aquisition Editor - Sara MahmoodSara was responsible for the initial inception of the Mastering Ansible Video course within Packt. After researching and discussing with a variety of authors, James Spurin was selected by Sara to bring the course to life. Sara has successfully helped Packt launch a multitude of online technical books and courses. Course ContentsInstallation and Configuration of Ansible The Course Overview Ansible Requirements – Python, PIP, and Virtual Environments Ansible Course Environment Setup Ansible on Microsoft Windows Ansible on Mac OS X Ansible on Linux Validating Ansible Installation Ansible Architecture and Design Ansible Inventories Ansible Modules YAML Ansible Playbooks, Breakdown of Sections Ansible Playbooks, Variables Ansible Playbooks, Facts Templating with Jinja2 Ansible Playbooks, Creating, and Executing Ansible Playbooks, Advanced Topics Ansible Playbook Modules Dynamic Inventories register and when Looping Asynchronous and Parallel Task Delegation Magic Variables Blocks Using the Ansible Vault Creating Custom Modules Creating Plugins Structuring Ansible Playbooks Using Includes and Imports Using Tags Using Roles Using Ansible with Cloud Services and Containers AWS with Ansible Docker Support with Ansible Other Ansible Resources and Areas Troubleshooting Ansible Validating Testing with Ansible Best Practices with Ansible Upgrading Ansible Links to the course Udemy Packtpub Safari Books Online"},{"title":"Purchase","date":"2019-03-09T16:55:22.000Z","updated":"2019-03-10T17:03:18.000Z","comments":true,"path":"purchase/index.html","permalink":"http://masteringansible.com/purchase/index.html","excerpt":"","text":"The course is available from a variety of different providers, please see - Udemy Link: https://www.udemy.com/mastering-ansible-x/ Packtpub Link: https://www.packtpub.com/virtualization-and-cloud/mastering-ansible-video Safari Books Online Link: https://www.oreilly.com/library/view/mastering-ansible/9781788629515/ Amazon Prime Video Link: https://www.amazon.com/Ansible-Course-Environment-Setup/dp/B07DYP4KSP"}],"posts":[{"title":"Ansible London Meetup 19th March 2019","slug":"Ansible-London-Meetup-19th-March-2019","date":"2019-03-20T17:36:00.000Z","updated":"2019-03-20T17:40:45.000Z","comments":true,"path":"2019/03/20/Ansible-London-Meetup-19th-March-2019/","link":"","permalink":"http://masteringansible.com/2019/03/20/Ansible-London-Meetup-19th-March-2019/","excerpt":"","text":"Narrated by James Spurin, @jamesspurin, the views and opinions are my own. All images in this post including the Sainsbury’s front desk were captured by myself during the event and are free to use, share or modify. The regular Ansible London Meetup was hosted yesterday, at the London Headquarters of Sainsbury’s, 33 High Holborn. A fantastic event with great talks, sprinkled, with some pure Ansible Magic! Ansible at G-Research (Luke Griffith)First to the stand to brave the crowd of Ansiblers was Luke Griffith of G-Research to talk about how they integrate aspects of automation into CI/CD pipeline execution with Ansible. The company has a philosophy of driving automation and self-service through GitOps. Luke made reference to how they make extensive use of AWX and why they opted to leverage AWX as an open source option instead of utilising the commercial offering of Ansible Tower. Luke explained that although they’ve experienced issues relating to stability when moving between releases, after all, AWX is the bleeding edge version of Ansible Tower, the deployment process that they implemented, leveraging configuration management and a local password vault (via Hashicorp Vault) allows them to reinstall AWX to a known working state should an issue arise. To both the delight and jest of the crowd, G-Research also detailed their efforts in automating Microsoft Windows through Ansible to achieve workstation/server standardisation, self-service patching, validation tests and immutable server builds. Although somewhat expected in a predominantly Linux focussed crowd, it was questioned why they were using Windows in the first place… a show of hands highlighted the bitter truth that in many organisations, Windows is an area that is both heavily used and requires automation. On elaboration, Luke helpfully covered their use and integration of Chocolatey, a toolset that allows package management on Windows. Variable precedence (Jiri Tyr)Next to the stage was Jiri Tyr, a veteran of the Ansible community with his regular appearances at Ansible meetups. Jtyr as he is otherwise known is an Ansible core developer and has authored over 100 publicly available Ansible Roles, Nice! In the opening slides, Jiri highlighted with precedence, 22 different means of defining a variable in Ansible. With detailed examples, he took the audience through the different types of approaches. The associated slides with this talk make an excellent resource and when available, I will be sharing the links in the comments section. There were a number of gems thrown into this talk that I liked, to summarise - Making use of ansible_facts. as a var prefix It is possible, for a custom fact to override the value, of a setup fact. By implicitly including the top level of ansible_facts when making a reference, you safeguard from this happening. Using the prefix of a custom fact name as a var prefix In the same way as implicitly using ansible_facts. to segregate a setup derived fact, we can use the naming structure of ansible_local.custom_fact_name.section.fact, for implicitly targeting custom facts Variable precedence (Jiri Tyr) continued…Finally, Jiri closed the session with summary slides of his recommended best practices - Data Deployments with Ansible at Growth Intelligence (Prash Majmudar)Prash boldly stepped up to the stage and confidently inserted the disclaimer that his role is more focused with himself as the CTO managing the company and less so on the technical detail of Ansible, however, Prash need not have worried as he provided an excellent overview of how they manage Data Deployments with Ansible at Growth Intelligence. The company uses machine learning against unstructured data to facilitate their customer recommendation engine. As well as Ansible, they make use of Python, Elasticsearch, React and Flask to name a few technologies. A great eye opener into the use of common open source software to facilitate a startup. Their Architecture diagram gives a very interesting insight into how Ansible fits in to their overall strategy. How I provision my Macbook with Ansible (Adam Johnson)Adam Johnson, well known for his efforts in the world of Django provided both an entertaining and insightful talk on how he leverages Ansible to facilitate automation of his personal development laptop. What I liked from a personal perspective about this talk was the very personal nature of the area it covered. Most of us who use Ansible end up using Ansible to deal with something related to a requirement in our respective work. Adam however uses Ansible here to automate his own laptop both for his work and recreational needs. As he put it, this is the playbook to make his mac, his mac. The main takeaways I found useful from his talk were the knowledge of homebrew-cask and mas, both of which simplifying the installation of Mac Apps (without and with, the app store respectively). I caught up with Adam afterwards and he is a truly nice guy, if you have questions on this, or Django I highly recommend you reaching out to him. On my todo list also … I’ve now added, automate my mac, after a result of seeing this brilliant talk, thanks Adam. KudosKudos to the speakers, the organisers - John Barker, Greg DeKoenigsberg, Andrea “Shaps” Tartaglia and Mark Phillips. To Sainsbury’s for hosting a great event. Lastly, to Bob Benson from Springer Nature, it was awesome discussing Ansible with you.","categories":[],"tags":[{"name":"Meetup","slug":"Meetup","permalink":"http://masteringansible.com/tags/Meetup/"}],"author":"James Spurin"},{"title":"Celebrating 3000+ Students at Udemy","slug":"Celebrating-3000-Students-at-Udemy","date":"2019-03-14T21:00:00.000Z","updated":"2019-03-14T20:30:07.000Z","comments":true,"path":"2019/03/14/Celebrating-3000-Students-at-Udemy/","link":"","permalink":"http://masteringansible.com/2019/03/14/Celebrating-3000-Students-at-Udemy/","excerpt":"","text":"One year on since initially launching our Mastering Ansible course in March 2018, we’re happy to have helped over 3000 students on Udemy, Master Ansible whilst consistently maintaining a Best Seller status for Ansible and a 4.x+ Average feedback. On behalf of all of the team, thank you. We hope you’ve enjoyed learning with us.","categories":[],"tags":[{"name":"Udemy","slug":"Udemy","permalink":"http://masteringansible.com/tags/Udemy/"},{"name":"Best Seller","slug":"Best-Seller","permalink":"http://masteringansible.com/tags/Best-Seller/"}],"author":"James Spurin"},{"title":"Using your own control host with the lab","slug":"Using-your-own-control-host-with-the-lab","date":"2019-03-14T20:00:00.000Z","updated":"2019-03-14T20:47:58.000Z","comments":true,"path":"2019/03/14/Using-your-own-control-host-with-the-lab/","link":"","permalink":"http://masteringansible.com/2019/03/14/Using-your-own-control-host-with-the-lab/","excerpt":"","text":"Whilst a control host for Ansible is provided with the course, i.e. the Virtual Machine called ubuntu-c, some prefer to configure their own control host. It is recommended that you leverage the provided control host for the best experience, however, this post gives some guidance on aspects that need to be considered to see the best from the course, should you decide to create your own. Assumed user of packt for Section 02. Ansible Architecture and Design, 01. Ansible InventoriesIn some of the examples used, the playbooks provided in the repo for both the centos and ubuntu hosts directly reference the target hostname with no implicit user - 123456789[centos]centos1centos2centos3[ubuntu]ubuntu1ubuntu2ubuntu3 In the starter sections of Architecture and Design, Ansible Inventories, if you were running this from the supplied control host (ubuntu-c), the user you’d be connecting from would by default be the packt user. Subsequently, the packt user, exists on all of the target lab hosts. The local user of your own control host is likely to be different and as a result, you’d experience issues with connectivity. To mitigate, make the following changes to playbooks, adding ansible_user=packt - 123456789[centos]centos1 ansible_user=packtcentos2 ansible_user=packtcentos3 ansible_user=packt[ubuntu]ubuntu1 ansible_user=packtubuntu2 ansible_user=packtubuntu3 ansible_user=packt Whilst this can be achieved in a more convenient fashion using vars, this isn’t covered until a later section, hence the approach above is recommended for consistency until familiarity with the different approaches is achieved. When progressing through the course, should the hosts file contain a connectivity that assumes a non root user, update the file either directly as above, or via a hosts var directive, i.e. 12[ubuntu:vars]ansible_user=packt Thanks to Andrew Graham (queglay) for highlighting this issue at https://github.com/spurin/masteringansible/issues/9 DNS IssuesThe control host supplied with the virtual machine is configured to resolve it’s DNS, from the supplied machine, dnsmasq. There’s a few ways of resolving this. A quick fix, is to set your DNS server temporarily, to that of the dnsmasq resolver at 192.168.0.40, it acts as a generic forwarder for other internet connectivity so shouldn’t affect your online experience, whilst the VM is running. Alternatively, if you’re familiar with editing hosts files, you can add entries accordingly on your control host as per the IP details provided in the lab slides. When doing so, add both the hostname and hostname.masteringansible.com entries for each. Again, thanks to Andrew Graham (queglay) for highlighting this issue at https://github.com/spurin/masteringansible/issues/8 Nginx playbookThe nginx playbook template was mapped against the nginx configuration of that available on the associated lab instances, i.e. centosx and ubuntux. The default nginx configuration across the multitude of linux flavours will vary and as a result, this exercise may or may not work effectively in your own environment outside of the lab. I suggest for this, either use the lab, or work on changing the templates to meet your local configuration, it shouldn’t be too difficult. If you do succeed, let me know in the comments and reference your updated templates. Thanks to Raj Burnwal (rajkrburnwal) for highlighting this issue at https://github.com/spurin/masteringansible/issues/6","categories":[],"tags":[{"name":"DNS","slug":"DNS","permalink":"http://masteringansible.com/tags/DNS/"},{"name":"Issues","slug":"Issues","permalink":"http://masteringansible.com/tags/Issues/"},{"name":"Control Host","slug":"Control-Host","permalink":"http://masteringansible.com/tags/Control-Host/"}],"author":"James Spurin"},{"title":"Update: Virtual Machine Images","slug":"Update-Virtual-Machine-Images","date":"2019-03-14T19:30:00.000Z","updated":"2019-03-14T14:16:21.000Z","comments":true,"path":"2019/03/14/Update-Virtual-Machine-Images/","link":"","permalink":"http://masteringansible.com/2019/03/14/Update-Virtual-Machine-Images/","excerpt":"","text":"Update to the Virtual Machine Images, the Lab machines have had a minor update, the motd (Message of the day) has been changed to reflect context regarding the 2 most important issues that trouble users of the course, a) The keyboard configuration not working whilst using the VM console and b) DNS not working, when the dnsmasq VM is not running. The MOTD looks like the following - 12345678910111213--== Mastering Ansible - Packt - James Spurin ==--* Official Website : https://masteringansible.com* Course Repository : https://github.com/spurin/masteringansible* Keyboard issues with the virtual machine see https://masteringansible.com/2019/03/10/Keyboard-Setup-for-Virtual-Machine-Lab/* DNS issues with the virtual machine see https://masteringansible.com/2019/03/13/DNS-Issues-with-Lab-Virtual-Machines/If you experience any lab issues that are not covered on masteringansible.com, contact the author - james@masteringansible.com Within the MOTD, on Ubuntu I’ve also disabled the advice checker that tells you that you can upgrade the virtual machine to the latest version of Ubuntu. I believe some users have seen this and have thought of it as a requirement prior to continuing. If you wish to, you can update the lab environment to the latest version of Ubuntu, however it is not a requirement and some of the playbooks that template the likes of nginx configuration may not work, if there’s been an upstream change to the base configuration. Given that the lab has been designed to match the context of the course, I advise that you don’t upgrade the environment, unless you’re happy to address subsequent changes that may arise to the course content.","categories":[],"tags":[{"name":"Virtual Machine","slug":"Virtual-Machine","permalink":"http://masteringansible.com/tags/Virtual-Machine/"},{"name":"motd","slug":"motd","permalink":"http://masteringansible.com/tags/motd/"}],"author":"James Spurin"},{"title":"DNS Issues with Lab Virtual Machines","slug":"DNS-Issues-with-Lab-Virtual-Machines","date":"2019-03-13T21:59:00.000Z","updated":"2019-03-14T17:44:17.000Z","comments":true,"path":"2019/03/13/DNS-Issues-with-Lab-Virtual-Machines/","link":"","permalink":"http://masteringansible.com/2019/03/13/DNS-Issues-with-Lab-Virtual-Machines/","excerpt":"","text":"An issue that I’ve been contacted about on the course, is a lack of internet connectivity within the guests of the VM lab. Naturally, when a system is started it’s almost like a motor reflex action, to ping google.com :) Whilst this would normally work, in the lab setup, the dedicated dnsmasq virtual machine acts as a DNS server for the rest of the lab environment. It provides internal DNS resolution for each of the nodes and DNS forwarding, for all other nodes in the lab. If you’re experiencing issues with DNS resolution, check that the dnsmasq virtual machine is running, that it’s IP address 192.168.0.40 is contactable, and from the dnsmasq guest, that internet connectivity is available. Should you have DNS issues outside of this, please leave a comment below or contact me via the social media links provided.","categories":[],"tags":[{"name":"Virtual Machine","slug":"Virtual-Machine","permalink":"http://masteringansible.com/tags/Virtual-Machine/"},{"name":"DNS","slug":"DNS","permalink":"http://masteringansible.com/tags/DNS/"},{"name":"Issues","slug":"Issues","permalink":"http://masteringansible.com/tags/Issues/"}],"author":"James Spurin"},{"title":"Virtual Machine Download","slug":"Virtual-Machine-Download","date":"2019-03-10T15:47:56.000Z","updated":"2019-03-10T16:01:18.000Z","comments":true,"path":"2019/03/10/Virtual-Machine-Download/","link":"","permalink":"http://masteringansible.com/2019/03/10/Virtual-Machine-Download/","excerpt":"","text":"The virtual machines used for the lab in the course, can be downloaded using the following shortened url - https://goo.gl/b68auU I’ve been contacted in the past and advised that this url has failed individuals, upon checking I’ve not seen any issues but thats not to say there wasn’t an intermittent failure. Google have discontinued their url shortening service but have advised that they will continue the url shortening service for existing urls. Should you face an issue, the full url for the lab hosts is as follows - https://drive.google.com/drive/folders/1QBgNs6knbwpSPyUMexDXhKjv3TO_Ka55","categories":[],"tags":[],"author":"James Spurin"},{"title":"Keyboard Setup for Virtual Machine Lab","slug":"Keyboard-Setup-for-Virtual-Machine-Lab","date":"2019-03-10T15:25:00.000Z","updated":"2019-03-14T17:44:05.000Z","comments":true,"path":"2019/03/10/Keyboard-Setup-for-Virtual-Machine-Lab/","link":"","permalink":"http://masteringansible.com/2019/03/10/Keyboard-Setup-for-Virtual-Machine-Lab/","excerpt":"","text":"The virtual machines supplied with the lab enviroment are configured by default with a UK keyboard. To change the keyboard for a specific locale, follow the instructions below based on whether or not it is a centos or a ubuntu installed system - CentOS based Virtual MachinesCheck the existing keyboard configuration with the command - 1# localectl Use the following command to search for available keymaps - 1# localectl list-keymaps Given the multitude of keymaps, you may wish to narrow the list down to a specific country, for example, for the US, you could use - 1# localectl list-keymaps | grep ^us Once you have identified a keymap, use the following command to set - 1# localectl set-keymap us Ubuntu based Virtual MachinesUse the configuration wizard to change the keyboard, by issuing the command 1$ sudo dpkg-reconfigure keyboard-configuration","categories":[],"tags":[{"name":"Virtual Machine","slug":"Virtual-Machine","permalink":"http://masteringansible.com/tags/Virtual-Machine/"},{"name":"Issues","slug":"Issues","permalink":"http://masteringansible.com/tags/Issues/"},{"name":"Keyboard","slug":"Keyboard","permalink":"http://masteringansible.com/tags/Keyboard/"}],"author":"James Spurin"},{"title":"About Mastering Ansible","slug":"About-Mastering-Ansible","date":"2019-03-09T16:28:00.000Z","updated":"2020-01-03T01:11:27.000Z","comments":true,"path":"2019/03/09/About-Mastering-Ansible/","link":"","permalink":"http://masteringansible.com/2019/03/09/About-Mastering-Ansible/","excerpt":"","text":"The Mastering Ansible Video Course. 11.5 hours of the finest Ansible Video Training available. Video DescriptionExploit the power of Ansible to expedite scalable orchestration, DevOps, and automation. About This VideoSuitable for users of all major operating systems (Windows, Mac OS X, and Linux). Explore Ansible with cloud services and its AWS provisioning. Troubleshoot Ansible and its supported resources and utilities. In DetailAnsible is a radically simple IT automation engine that automates cloud provisioning, configuration management, application deployment, intra-service orchestration, and many other IT needs. Designed for multi-tier deployments since day one, Ansible models your IT infrastructure by describing how all of your systems inter-relate, rather than just managing one system at a time. This professional video course on Ansible guides the user through a multitude of topics in order to understand and professionally master Ansible. It aims to help you master Ansible while tackling and learning multiple topics. It starts with Ansible’s architecture and how to provide effective scalable automation. Then we move on to installing and configuring it with various platforms. Further, we look into Ansible modules and playbooks with YAML syntax and execute it. Next you will get to know about advanced Ansible playbooks, and even structure them. You will learn to use Ansible with cloud services and containers and provision it with AWS and Docker. Finally, you will master troubleshooting, validating, and testing with Ansible. About the Author - James Spurin James Spurin is an IT professional with over 15 years of experience, working in a variety of technology fields including Internet Technologies, Automation, Software Development, Enterprise Storage and Unix Administration. Holds an MSc with Distinction in Computer Science, Information Technology from Liverpool University. Has professionally worked for a variety of major organisations including Nomura, Goldman Sachs, Hitachi Data Systems, Dell EMC and Virgin Internet. Also an advisory board member for StorageOS, a container based storage solution. An active contributor to open source software and also the creator of XML Dataset, a python library featured on the Awesome Python list under XML parsers. About the Technical Reviewer - Ana Jalba Ana Jalba is the technical reviewer for the course. Ana, has an extensive background in Software Development and is a Software Engineer at Hotels.com, not to mention, a long time user and advocate of Ansible. During the course creation, Ana went through every aspect providing extensive feedback and testing, both of the initial course run book, and the video course. About the Senior Content Developer Editor - Abhishek Angne Abhishek has a meticulous eye for detail, and within his role at Packt as the Senior Content Developer Editor, worked with local teams covering all aspects of post development, enhancements and marketing. About the Aquisition Editor - Sara MahmoodSara was responsible for the initial inception of the Mastering Ansible Video course within Packt. After researching and discussing with a variety of authors, James Spurin was selected by Sara to bring the course to life. Sara has successfully helped Packt launch a multitude of online technical books and courses. Course ContentsInstallation and Configuration of Ansible The Course Overview Ansible Requirements – Python, PIP, and Virtual Environments Ansible Course Environment Setup Ansible on Microsoft Windows Ansible on Mac OS X Ansible on Linux Validating Ansible Installation Ansible Architecture and Design Ansible Inventories Ansible Modules YAML Ansible Playbooks, Breakdown of Sections Ansible Playbooks, Variables Ansible Playbooks, Facts Templating with Jinja2 Ansible Playbooks, Creating, and Executing Ansible Playbooks, Advanced Topics Ansible Playbook Modules Dynamic Inventories register and when Looping Asynchronous and Parallel Task Delegation Magic Variables Blocks Using the Ansible Vault Creating Custom Modules Creating Plugins Structuring Ansible Playbooks Using Includes and Imports Using Tags Using Roles Using Ansible with Cloud Services and Containers AWS with Ansible Docker Support with Ansible Other Ansible Resources and Areas Troubleshooting Ansible Validating Testing with Ansible Best Practices with Ansible Upgrading Ansible Links to the course Udemy Packtpub Safari Books Online","categories":[],"tags":[{"name":"About","slug":"About","permalink":"http://masteringansible.com/tags/About/"}],"author":"James Spurin"}]}